flysight/flysight-2-firmware/STM32_WPAN/App/app_ble.c
  /* USER CODE BEGIN SVCCTL_App_Notification */

  /* USER CODE END SVCCTL_App_Notification */

  p_event_pckt = (hci_event_pckt*) ((hci_uart_pckt *) p_Pckt)->data;

  switch (p_event_pckt->evt)
  {
    case HCI_DISCONNECTION_COMPLETE_EVT_CODE:
      p_disconnection_complete_event = (hci_disconnection_complete_event_rp0 *) p_event_pckt->data;

      /* USER CODE BEGIN EVT_DISCONN_COMPLETE */

      /* USER CODE END EVT_DISCONN_COMPLETE */
      if (p_disconnection_complete_event->Connection_Handle == BleApplicationContext.connectionHandleEndDevice1)
      {
        APP_DBG_MSG("\r\n\r** DISCONNECTION EVENT OF END DEVICE 1 \n\r");
        BleApplicationContext.EndDevice_Connection_Status[0] = APP_BLE_IDLE;
        BleApplicationContext.connectionHandleEndDevice1 = 0xFFFF;
        HandleNotification.Custom_Evt_Opcode = CUSTOM_DISCON_DEV_1_HANDLE_EVT;
        HandleNotification.ConnectionHandle = 0xFFFF;
        Custom_APP_Notification(&HandleNotification);
      }

      if (p_disconnection_complete_event->Connection_Handle == BleApplicationContext.connectionHandleCentral)
      {
        APP_DBG_MSG("\r\n\r** DISCONNECTION EVENT OF SMART PHONE \n\r");
        BleApplicationContext.SmartPhone_Connection_Status = APP_BLE_IDLE;
        BleApplicationContext.connectionHandleCentral = 0xFFFF;

        if (FS_State_Get()->enable_ble)
        {
          /* restart advertising */
          FS_Adv_Request(APP_BLE_FAST_ADV);
        }

        HandleNotification.Custom_Evt_Opcode = CUSTOM_DISCON_HANDLE_EVT;
        HandleNotification.ConnectionHandle = 0xFFFF;
        Custom_APP_Notification(&HandleNotification);
      }
      break; /* HCI_DISCONNECTION_COMPLETE_EVT_CODE */

    case HCI_LE_META_EVT_CODE:
    {
      p_meta_evt = (evt_le_meta_event*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_LE_META_EVENT */

      /* USER CODE END EVT_LE_META_EVENT */
      switch (p_meta_evt->subevent)
      {
        case HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE:
#if (CFG_DEBUG_APP_TRACE != 0)
          p_connection_update_complete_event = (hci_le_connection_update_complete_event_rp0 *) p_meta_evt->data;
          APP_DBG_MSG(">>== HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE\n");
          APP_DBG_MSG("     - Connection Interval:   %.2f ms\n     - Connection latency:    %d\n     - Supervision Timeout: %d ms\n\r",
                       p_connection_update_complete_event->Conn_Interval*1.25,
                       p_connection_update_complete_event->Conn_Latency,
                       p_connection_update_complete_event->Supervision_Timeout*10);
#endif /* CFG_DEBUG_APP_TRACE != 0 */

          /* USER CODE BEGIN EVT_LE_CONN_UPDATE_COMPLETE */

          /* USER CODE END EVT_LE_CONN_UPDATE_COMPLETE */
          break;

        case HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE:
          p_enhanced_connection_complete_event = (hci_le_enhanced_connection_complete_event_rp0 *) p_meta_evt->data;
          /**
           * The connection is done, there is no need anymore to schedule the LP ADV
           */

          connection_handle = p_enhanced_connection_complete_event->Connection_Handle;
          role = p_enhanced_connection_complete_event->Role;
          if (role == 0x00)
          { /* ROLE CENTRAL */
            /* Inform Application it is End Device 1 */
            APP_DBG_MSG("-- CONNECTION SUCCESS WITH END DEVICE 1\n\r");
            BleApplicationContext.EndDevice_Connection_Status[0] = APP_BLE_CONNECTED;
            BleApplicationContext.connectionHandleEndDevice1 = connection_handle;
            HandleNotification.Custom_Evt_Opcode = CUSTOM_CONN_DEV_1_HANDLE_EVT;
            HandleNotification.ConnectionHandle = connection_handle;
            Custom_APP_Notification(&HandleNotification);
            result = aci_gatt_disc_all_primary_services(BleApplicationContext.connectionHandleEndDevice1);
            if (result == BLE_STATUS_SUCCESS)
            {
              APP_DBG_MSG("\r\n\r** GATT SERVICES & CHARACTERISTICS DISCOVERY  \n\r");
              APP_DBG_MSG("* GATT :  Start Searching Primary Services \r\n\r");
            }
            else
            {
              APP_DBG_MSG("BLE_CTRL_App_Notification(), All services discovery Failed \r\n\r");
            }
          }
          else
          {
            APP_DBG_MSG("-- CONNECTION SUCCESS WITH SMART PHONE\n\r");
            BleApplicationContext.SmartPhone_Connection_Status = APP_BLE_CONNECTED;
            BleApplicationContext.connectionHandleCentral = connection_handle;
            HandleNotification.Custom_Evt_Opcode = CUSTOM_CONN_HANDLE_EVT;
            HandleNotification.ConnectionHandle = connection_handle;
            Custom_APP_Notification(&HandleNotification);

            /* Stop the timer */
            HW_TS_Stop(Advertising_mgr_timer_Id);

            /* Call advertising callback */
            if (Adv_Callback) Adv_Callback();

            /* Update advertising callback */
            Adv_Callback = Next_Adv_Callback;
            Next_Adv_Callback = 0;

            /* Configure the link */
            UTIL_SEQ_SetTask(1 << CFG_TASK_LINK_CONFIG_ID, CFG_SCH_PRIO_1);
          }
          break; /* HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */

        case HCI_LE_ADVERTISING_REPORT_SUBEVT_CODE:
          /* USER CODE BEGIN EVT_LE_ADVERTISING_REPORT */

          /* USER CODE END EVT_LE_ADVERTISING_REPORT */
          le_advertising_event = (hci_le_advertising_report_event_rp0 *) p_meta_evt->data;

          event_type = le_advertising_event->Advertising_Report[0].Event_Type;

          event_data_size = le_advertising_event->Advertising_Report[0].Length_Data;

          /* WARNING: be careful when decoding advertising report as its raw format cannot be mapped on a C structure.
          The data and RSSI values could not be directly decoded from the RAM using the data and RSSI field from hci_le_advertising_report_event_rp0 structure.
          Instead they must be read by using offsets (please refer to BLE specification).
          RSSI = (int8_t)*(uint8_t*) (adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data);
          */
          adv_report_data = (uint8_t*)(&le_advertising_event->Advertising_Report[0].Length_Data) + 1;
          k = 0;

